# Core Brewfile
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'railwaycat/emacsmacport'

brew 'autojump'
brew 'coreutils'
brew 'ghostscript'
brew 'git'
brew 'htop'
brew 'httpie'
brew 'mas'
brew 'neovim'
brew 'python'
brew 'railwaycat/emacsmacport/emacs-mac', args: ['with-gnutls', 'with-imagemagick', 'with-official-icon', 'with-xml2']
brew 'ripgrep'
brew 'shellcheck'
brew 'stow'
brew 'tmux'
brew 'tree'
brew 'wget'

cask '1password'
cask 'alfred'
cask 'docker'
cask 'firefox'
cask 'font-fira-code'
cask 'google-chrome'
cask 'iterm2'
cask 'slack'
cask 'spotify'
cask 'the-unarchiver'
cask 'virtualbox'

mas 'Silicio', id: 933627574
mas 'Twitter', id: 409789998
